[
  {
    "name": "Drum-Kit",
    "description": "Simulation of a drum kit using either key-strokes or the mouse. Try your best to become the Drum Hero.",
    "technologies": [
      "CSS",
      "JavaScript",
      "HTML"
    ],
    "link": "https://github.com/jacobtordjman/Drum-Kit"
  },
  {
    "name": "Exponenia",
    "description": "Exponenia is a challenging game that includes problem solving in a fun way. Exponenia uses the logic of the game '2048' but in a very different angle.",
    "technologies": [
      "TypeScript",
      "Kotlin",
      "Objective-C",
      "Ruby",
      "Objective-C++",
      "JavaScript"
    ],
    "link": "https://github.com/jacobtordjman/Exponenia"
  },
  {
    "name": "GameOfLife",
    "description": "This project is an implementation of Conway's Game of Life, a cellular automaton devised by mathematician John Conway. The game consists of a grid of cells that evolve through generations according to a set of simple rules. This project provides an interactive interface to visualize and control the simulation.",
    "technologies": [
      "Java"
    ],
    "link": "https://github.com/jacobtordjman/GameOfLife"
  },
  {
    "name": "Mini-Linux-Shell",
    "description": " The Custom Shell Project implements a custom shell in C with various functionalities akin to a Unix shell. Key features include command execution, background job management, aliasing, command redirection, logical operators, and script execution. Commands are executed via fork and execvp, with proper signal handling and error reporting.",
    "technologies": [
      "C",
      "Shell"
    ],
    "link": "https://github.com/jacobtordjman/Mini-Linux-Shell"
  },
  {
    "name": "Password-Manager",
    "description": "MyPass is a simple and intuitive password manager that allows users to securely store and generate passwords for various websites. This application provides a user-friendly interface for managing your credentials in one place.",
    "technologies": [
      "Python"
    ],
    "link": "https://github.com/jacobtordjman/Password-Manager"
  },
  {
    "name": "Portfolio",
    "description": "This is my Portfolio which is always under construction and always improving, just like my skills. The website is written using React.js and Node.js, JS and CSS",
    "technologies": [
      "JavaScript",
      "CSS",
      "HTML"
    ],
    "link": "https://github.com/jacobtordjman/Portfolio"
  },
  {
    "name": "Simon-Game",
    "description": "Welcome to the Simon Game Web! This project is a web-based implementation of the classic Simon game, where players must remember and repeat increasingly long sequences of colors and sounds. It's a great project to practice web development skills using HTML, CSS, and JavaScript.",
    "technologies": [
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "link": "https://github.com/jacobtordjman/Simon-Game"
  },
  {
    "name": "SnakeGame",
    "description": "The Snake Game project, written in Python using the Turtle module, features classic gameplay where players control a snake to collect food and grow longer. Key elements include a game loop, collision detection, score tracking, and increasing speed as the snake grows. The game uses Turtle graphics for rendering the snake and food.",
    "technologies": [
      "Python",
      "Tcl",
      "TeX",
      "HTML",
      "PowerShell",
      "Batchfile"
    ],
    "link": "https://github.com/jacobtordjman/SnakeGame"
  },
  {
    "name": "The-Dice-Games-Web",
    "description": "A very simple web app for two individuals to decide who is write, who goes first, who wins and of course who loses.",
    "technologies": [
      "CSS",
      "HTML",
      "JavaScript"
    ],
    "link": "https://github.com/jacobtordjman/The-Dice-Games-Web"
  },
  {
    "name": "TurtleCrossingGame",
    "description": "The Turtle Crossing Game is a fun and interactive game where the player controls a turtle attempting to cross a busy road filled with moving cars. The objective is to avoid the cars and successfully reach the other side of the screen. The game is developed using Python and the turtle graphics module.",
    "technologies": [
      "Python",
      "TeX",
      "HTML",
      "PowerShell",
      "Batchfile"
    ],
    "link": "https://github.com/jacobtordjman/TurtleCrossingGame"
  },
  {
    "name": "WeatherForecast",
    "description": "Weather Forecast project is a C++ application that allows users to fetch and display weather data for various cities using the OpenWeatherMap API. The application features a graphical user interface built with ImGui and uses GLFW and GLEW for window and OpenGL context management.",
    "technologies": [
      "C++",
      "C",
      "Objective-C++",
      "Objective-C",
      "Makefile",
      "Batchfile",
      "CMake",
      "HTML",
      "Kotlin",
      "GLSL",
      "GDB",
      "Shell"
    ],
    "link": "https://github.com/jacobtordjman/WeatherForecast"
  }
]